import numpy as np

X = np.array([[-1, -1, -1], [+1, -1, -1],
              [-1, +1, -1], [+1, +1, -1],
              [-1, -1, +1], [+1, -1, +1],
              [-1, +1, +1], [+1, +1, +1]])

coeffs = np.array([
    [4.307,	4.284,	4.284,	4.316,	4.286],
    [8.387,	8.396,	8.430,	8.389,	8.404],
    [5.832,	5.873,	5.856,	5.843,	5.862],
    [13.329, 13.304, 13.328, 13.340, 13.312],
    [7.379,	7.415,	7.415,	7.368,	7.368],
    [20.255, 20.278, 20.304, 20.279, 20.261],
    [11.226, 11.238, 11.271, 11.234, 11.273],
    [66.599, 66.605, 66.588, 66.595, 66.562]
])

Y = np.zeros(8)
for i in range(0, 8):
    x = 0
    for j in range(0, 5):
        x += coeffs[i][j]
    Y[i] = x / 5
print("Средняя функция отклика")
print(Y)

N = 8
b0 = np.sum(Y) / N

x1yi = 0
for i in range(0, 8):
    x1yi += X[i][0] * Y[i]

x2yi = 0
for i in range(0, 8):
    x2yi += X[i][1] * Y[i]

x3yi = 0
for i in range(0, 8):
    x3yi += X[i][2] * Y[i]

b1 = x1yi / N
b2 = x2yi / N
b3 = x3yi / N
print("Без учета факторов")
print("значения коэффициентов регрессии")
print("b1 = ", b1, " ")
print("b2 = ", b2, " ")
print("b3 = ", b3, " ")


YY = np.zeros(8)

for i in range(0, 8):
    YY[i] = b0 + b1 * X[i][0] + b2 * X[i][1] + b3 * X[i][2]

W = np.max(YY - Y)
w = np.max(W * 100 / np.max(Y))

print("Коэффициенты, полученные после вычисления функции")
print(YY)
print("Абсолютная и относительная ошибки")
print("W = ", W, " ")
print("w = ", w, " ")

X = np.array([
    [-1, -1, -1, +1, +1, +1, -1],
    [+1, -1, -1, -1, -1, +1, +1],
    [-1, +1, -1, -1, +1, -1, +1],
    [+1, +1, -1, +1, -1, -1, -1],
    [-1, -1, +1, +1, -1, -1, +1],
    [+1, -1, +1, -1, +1, -1, -1],
    [-1, +1, +1, -1, -1, +1, -1],
    [+1, +1, +1, +1, +1, +1, +1]])

print("С учетом факторов")

x1x2yi = 0
for i in range(0, 8):
    x1x2yi += X[i][3] * Y[i]
b12 = x1x2yi / N

x1x3yi = 0
for i in range(0, 8):
    x1x3yi += X[i][4] * Y[i]

b13 = x1x3yi / N

x2x3yi = 0
for i in range(0, 8):
    x2x3yi += X[i][5] * Y[i]

b23 = x2x3yi / N

x1x2x3yi = 0
for i in range(0, 8):
    x1x2x3yi += X[i][6] * Y[i]

b123 = x1x2x3yi / N

print("значения коэффициентов регрессии")
print("b1 = ", b1, " ")
print("b2 = ", b2, " ")
print("b3 = ", b3, " ")
print("b12 = ", b12, " ")
print("b13 = ", b13, " ")
print("b23 = ", b23, " ")
print("b123 = ", b123, " ")

YYY = np.zeros(8)

for i in range(0, 8):
    YYY[i] = b0 + b1 * X[i][0] + b2 * X[i][1] + b3 * X[i][2] + b12 * X[i][3] + b13 * X[i][4] + b23 * X[i][5] + b123 * \
             X[i][6]

WW = np.max(YYY - Y)
ww = np.max(WW * 100 / np.max(Y))
print("расчетные значения функции отклика по регрессионной модели")
print(YYY)
print("Абсолютная и относительная ошибки")
print("W = ", WW, " ")
print("w = ", ww, " ")
